Repository: Hazix00/InstagramClone
Catalog: InstagramClone.Core/Resources/ValidationMessages.*.resx
Languages: ar, fr

# Required_Username
source: Username is required
ar: اسم المستخدم مطلوب
fr: Le nom d'utilisateur est requis

# MinLength_Username
source: Username must be at least {1} characters
ar: يجب أن لا يقل اسم المستخدم عن {1} حروف
fr: Le nom d'utilisateur doit comporter au moins {1} caractères

# MaxLength_Username
source: Username cannot exceed {1} characters
ar: لا يمكن أن يتجاوز اسم المستخدم {1} حروف
fr: Le nom d'utilisateur ne peut pas dépasser {1} caractères

# Invalid_UsernameFormat
source: Username can only contain letters, numbers, and underscores
ar: يمكن أن يحتوي اسم المستخدم على أحرف وأرقام وشرطات سفلية فقط
fr: Le nom d'utilisateur ne peut contenir que des lettres, des chiffres et des underscores

# Required_Email
source: Email is required
ar: البريد الإلكتروني مطلوب
fr: L'e-mail est requis

# Invalid_Email
source: Invalid email address
ar: بريد إلكتروني غير صالح
fr: Adresse e-mail invalide

# Required_Password
source: Password is required
ar: كلمة المرور مطلوبة
fr: Le mot de passe est requis

# MinLength_Password
source: Password must be at least {1} characters
ar: يجب أن لا تقل كلمة المرور عن {1} حروف
fr: Le mot de passe doit comporter au moins {1} caractères

# MaxLength_Password
source: Password cannot exceed {1} characters
ar: لا يمكن أن تتجاوز كلمة المرور {1} حروف
fr: Le mot de passe ne peut pas dépasser {1} caractères

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين
fr: Les mots de passe ne correspondent pas

# Required_ConfirmPassword
source: Confirm password is required
ar: تأكيد كلمة المرور مطلوب
fr: La confirmation du mot de passe est requise

# Required_ImageUrl
source: Image URL is required
ar: رابط الصورة مطلوب
fr: L'URL de l'image est requise

# MaxLength_ImageUrl
source: Image URL cannot exceed {1} characters
ar: لا يمكن أن يتجاوز رابط الصورة {1} حروف
fr: L'URL de l'image ne peut pas dépasser {1} caractères

# MaxLength_Caption
source: Caption cannot exceed {1} characters
ar: لا يمكن أن يتجاوز التعليق {1} حروف
fr: La légende ne peut pas dépasser {1} caractères

# Required_Content
source: Content is required
ar: المحتوى مطلوب
fr: Le contenu est requis

# MaxLength_Content
source: Content cannot exceed {1} characters
ar: لا يمكن أن يتجاوز المحتوى {1} حروف
fr: Le contenu ne peut pas dépasser {1} caractères

# Required_Token
source: Token is required
ar: الرمز مطلوب
fr: Le jeton est requis

# MaxLength_Email
source: Email cannot exceed {1} characters
ar: لا يمكن أن يتجاوز البريد الإلكتروني {1} حروف
fr: L'e-mail ne peut pas dépasser {1} caractères
